/*****************************Task_25***********************************/
////////////////////////////////////////////////////////////////////////////////
// Принимаем A и B, на выходе возводим A  в степень B
////////////////////////////////////////////////////////////////////////////////

// Console.Write("Введите любое целое число, которое хотите возвести в степень: ");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите натуральную степень: ");
// int B = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine(Math.Pow(A,B));

/*****************************Task_27***********************************/
////////////////////////////////////////////////////////////////////////////////
// Принимаем число X, выдаем сумму цифр этого числа
////////////////////////////////////////////////////////////////////////////////

// Console.Write("Введите любое целое число: ");
// int x = Convert.ToInt32(Console.ReadLine());
// int sum = 0;
// adder();

// void adder()
// {
//     if (x > 0)
//     {
//         while (x > 0)
//         {
//             sum+= x%10;
//             x/=10;
//         }
//         Console.WriteLine(sum);
//     }
//     else
//     {
//         x*=-1;
//         while (x > 0)
//         {
//             sum+= x%10;
//             x/=10;
//         }
//         Console.WriteLine(sum);
//     }
    
// }

/*****************************Task_29***********************************/
////////////////////////////////////////////////////////////////////////////////
// Создвем массив из 8 элементов
////////////////////////////////////////////////////////////////////////////////
int[] array = new int[8];
int i;
Console.Write("[");
CreateArray();
Console.Write("]");

void CreateArray()
{
    for (i = 0; i < array.Length - 1; i++)
    {
        array[i] = new Random().Next(-100,101);
        Console.Write(array[i] + ", ");
    }
    array[7] = new Random().Next(-100,101);
    Console.Write(array[7]);
}
